{ "projects":[
  {"title" : "Creating my Personal Page",
          "date" : "Personal Project in 2018 Summer",
          "image" : "personalPage",
          "imageDesc" : "Projects page on my personal site",
          "caption" : "Desktop and mobile friendly site developed in React with usage of Material-UI components.",
          "paragraphs" : ["After enjoying using React.js within the development of MatchUps I chose to use it once more in making the site you are on now.",
                          "In this site I also made use of Material-UI components to ensure that this site easily scales between both desktop and mobile usage."]},
  {"title" : "MatchUps",
    "date" : "3rd term of 2nd year",
    "image" : "matchUpsImage",
    "imageDesc" : "MatchUps Chat Screen",
    "caption" : "Group project at university. Developed with React, GoLang, Pusher, PSql and Jenkins for Continuous integration.",
    "paragraphs" : ["The purpose of the application was to help with setting up amateur sport games. Allowing people to build their own team and then we'd use the information they gave on availability location and sport to find them a fixture." ,
                    "For the front end of our application we used React which allowed us to have easily reusable components across several pages. Pusher was used for real time updating of the chats."]},
  {"title" : "Building an Operating System",
    "date" : "2nd term of 2nd year",
    "caption" : "Group project at university. Developed in C.",
    "paragraphs" : ["We implemented most aspects of an operating system including memory management and scheduling."]},
  {"title" : "Building a Compiler",
      "date" : "1st term of 2nd year",
      "caption" : "Group project at university. Developed in Java making use of Antlr parser.",
      "paragraphs" : ["We built a compiler for a language defined by the university. As an extension for this project we focused on constant propagation and removal of dead code as methods of optimising our compiler."]},
  {"title" : "Tournament Tracker and Result Analysis",
          "date" : "Personal Project in 2017 Summer",
          "image" : "tournamentTracker",
          "imageDesc" : "Tournament Tracker Player Performance Summary",
          "caption" : "Developed with HTML, CSS, Javascript and PHP",
          "paragraphs" : ["I chose to develop an application which could take a list of participants and produce fixtures for a tournament as well as the ability to enter results and see a table of these results",
                          "One I has the basic functionality added I then looked into useful summaries of data I could produce, the example image for this is one of them where I give summaries of people against opponents.",
                          "This project was my first attempt at web development, my motivation was to learn about web development and I now use this site to track FIFA tournaments I have with friends."]},
  {"title" : "Tron Artificial Intelligence",
    "image" : "tron",
    "imageDesc" : "Example Tron AI game",
    "date" : "3rd term of 1st year",
    "caption" : "This was developed in C as a group of 4 making use of the OpenGL graphics library.",
    "paragraphs" : ["The task was to develop anything in C, my group chose to recreate the classic arcade game Tron but we focued on devloping an AI to play the game against, above is an image of ... AI playing."]},
  {"title" : "Building an Assembler and Emulator",
      "date" : "3rd term of 1st year",
      "caption" : "Developed in C",
      "paragraphs" : ["Within a group of 4 we produced an emulator and assembler were for the ARM assembly language"]},
  {"title" : "Simultaneous Localisation and Mapping — Research Project",
    "date" : "2nd term of 1st year",
    "caption" : "HTML, CSS and Javascript used for website.",
    "paragraphs" : ["A group research project which involved us developing a website and presentation with our findings on the topic."]}
]}
